---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ImportAdtComponentsDesc
source: html/e02923f7-8eb5-a1f4-a448-a924469dd7e9.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ImportAdtComponentsDesc Property

"Component Description"

## Syntax (C#)
```csharp
public static ForgeTypeId ImportAdtComponentsDesc { get; }
```